var buildings = [
    {
        "id": "2X3B6674BL",
        "lat": 23.9762998859,
        "lng": 121.605713833,
        "name": "建築 2X3B6674BL"
    },
    {
        "id": "2X5KN6777S",
        "lat": 23.9789426154,
        "lng": 121.608015812,
        "name": "建築 2X5KN6777S"
    },
    {
        "id": "2X5JQ679DG",
        "lat": 23.9809585136,
        "lng": 121.607995204,
        "name": "建築 2X5JQ679DG"
    },
    {
        "id": "2X5KN6799Q",
        "lat": 23.9808529056,
        "lng": 121.608020135,
        "name": "建築 2X5KN6799Q"
    },
    {
        "id": "2X358678PL",
        "lat": 23.9803371317,
        "lng": 121.605557516,
        "name": "建築 2X358678PL"
    },
    {
        "id": "2Q5335NW4B",
        "lat": 23.4978388028,
        "lng": 121.38068292,
        "name": "建築 2Q5335NW4B"
    },
    {
        "id": "2Q6S95NUQK",
        "lat": 23.4965704166,
        "lng": 121.382408123,
        "name": "建築 2Q6S95NUQK"
    },
    {
        "id": "2Q6LV5NUR7",
        "lat": 23.4965889679,
        "lng": 121.382239987,
        "name": "建築 2Q6LV5NUR7"
    },
    {
        "id": "2Q6U05NURU",
        "lat": 23.4966070143,
        "lng": 121.382462186,
        "name": "建築 2Q6U05NURU"
    },
    {
        "id": "2Q6R65NURP",
        "lat": 23.4966025631,
        "lng": 121.382373934,
        "name": "建築 2Q6R65NURP"
    },
    {
        "id": "2Q4D15NURB",
        "lat": 23.4965976729,
        "lng": 121.3799882,
        "name": "建築 2Q4D15NURB"
    },
    {
        "id": "2Q6KM5NURJ",
        "lat": 23.4965986237,
        "lng": 121.382200656,
        "name": "建築 2Q6KM5NURJ"
    },
    {
        "id": "2Q6SN5NUS7",
        "lat": 23.4966169928,
        "lng": 121.382421548,
        "name": "建築 2Q6SN5NUS7"
    },
    {
        "id": "2Q6PV5NUS1",
        "lat": 23.4966123242,
        "lng": 121.382334052,
        "name": "建築 2Q6PV5NUS1"
    },
    {
        "id": "2Q6FM5NUSL",
        "lat": 23.4966292853,
        "lng": 121.382075895,
        "name": "建築 2Q6FM5NUSL"
    },
    {
        "id": "2Q6Q45NUSV",
        "lat": 23.4966367272,
        "lng": 121.382341087,
        "name": "建築 2Q6Q45NUSV"
    },
    {
        "id": "2Q6RD5NUSJ",
        "lat": 23.4966269161,
        "lng": 121.382380971,
        "name": "建築 2Q6RD5NUSJ"
    },
    {
        "id": "2Q6JA5NURV",
        "lat": 23.4966088756,
        "lng": 121.382159026,
        "name": "建築 2Q6JA5NURV"
    },
    {
        "id": "2Q6NS5NUT8",
        "lat": 23.496646932,
        "lng": 121.382299486,
        "name": "建築 2Q6NS5NUT8"
    },
    {
        "id": "2Q6ED5NUSW",
        "lat": 23.4966389799,
        "lng": 121.382036227,
        "name": "建築 2Q6ED5NUSW"
    },
    {
        "id": "2Q6NJ5NUSD",
        "lat": 23.496622529,
        "lng": 121.38229245,
        "name": "建築 2Q6NJ5NUSD"
    },
    {
        "id": "2Q6MH5NUTJ",
        "lat": 23.4966567459,
        "lng": 121.382259563,
        "name": "建築 2Q6MH5NUTJ"
    },
    {
        "id": "2Q6L15NUT2",
        "lat": 23.4966419978,
        "lng": 121.382213196,
        "name": "建築 2Q6L15NUT2"
    },
    {
        "id": "2Q6MA5NUSP",
        "lat": 23.496632343,
        "lng": 121.382252527,
        "name": "建築 2Q6MA5NUSP"
    },
    {
        "id": "2Q6L85NUTV",
        "lat": 23.4966663999,
        "lng": 121.382220233,
        "name": "建築 2Q6L85NUTV"
    },
    {
        "id": "2Q6JP5NUTD",
        "lat": 23.4966522489,
        "lng": 121.382171516,
        "name": "建築 2Q6JP5NUTD"
    },
    {
        "id": "2Q1EV5NRQ2",
        "lat": 23.493794182,
        "lng": 121.377031672,
        "name": "建築 2Q1EV5NRQ2"
    },
    {
        "id": "2Q1JU5NRHT",
        "lat": 23.493613791,
        "lng": 121.377155413,
        "name": "建築 2Q1JU5NRHT"
    },
    {
        "id": "2Q1ES5NRJ3",
        "lat": 23.4936217019,
        "lng": 121.377027868,
        "name": "建築 2Q1ES5NRJ3"
    },
    {
        "id": "2Q1E65NRJJ",
        "lat": 23.4936351906,
        "lng": 121.377008537,
        "name": "建築 2Q1E65NRJJ"
    },
    {
        "id": "2Q4WU5NSUJ",
        "lat": 23.4948400603,
        "lng": 121.380543784,
        "name": "建築 2Q4WU5NSUJ"
    },
    {
        "id": "2Q53S5NSVR",
        "lat": 23.4948746827,
        "lng": 121.380697201,
        "name": "建築 2Q53S5NSVR"
    },
    {
        "id": "2Q51F5NSVN",
        "lat": 23.4948733541,
        "lng": 121.380621311,
        "name": "建築 2Q51F5NSVN"
    },
    {
        "id": "2Q52C5NSW9",
        "lat": 23.4948893509,
        "lng": 121.38065218,
        "name": "建築 2Q52C5NSW9"
    },
    {
        "id": "2Q4V55NT1K",
        "lat": 23.4949857075,
        "lng": 121.380489262,
        "name": "建築 2Q4V55NT1K"
    },
    {
        "id": "2P4G95N69W",
        "lat": 23.4758840006,
        "lng": 121.347953092,
        "name": "建築 2P4G95N69W"
    },
    {
        "id": "2P5FJ5N533",
        "lat": 23.4747546994,
        "lng": 121.348935658,
        "name": "建築 2P5FJ5N533"
    },
    {
        "id": "2P5FQ5N5HS",
        "lat": 23.4751849929,
        "lng": 121.348936558,
        "name": "建築 2P5FQ5N5HS"
    },
    {
        "id": "2P5M75N5CN",
        "lat": 23.4750362685,
        "lng": 121.349108032,
        "name": "建築 2P5M75N5CN"
    },
    {
        "id": "2P5PQ5N5DR",
        "lat": 23.4750670479,
        "lng": 121.349189323,
        "name": "建築 2P5PQ5N5DR"
    },
    {
        "id": "2P5HM5N462",
        "lat": 23.4739176893,
        "lng": 121.348986266,
        "name": "建築 2P5HM5N462"
    },
    {
        "id": "2P5LW5N47X",
        "lat": 23.4739752345,
        "lng": 121.349095905,
        "name": "建築 2P5LW5N47X"
    },
    {
        "id": "2P0Q75N5NW",
        "lat": 23.4753431431,
        "lng": 121.34418953,
        "name": "建築 2P0Q75N5NW"
    },
    {
        "id": "2P5RW5N3XT",
        "lat": 23.4737463392,
        "lng": 121.349257565,
        "name": "建築 2P5RW5N3XT"
    },
    {
        "id": "2P5HE5N42M",
        "lat": 23.4738225984,
        "lng": 121.348985785,
        "name": "建築 2P5HE5N42M"
    },
    {
        "id": "2P3E35NTAV",
        "lat": 23.4953332238,
        "lng": 121.34693243,
        "name": "建築 2P3E35NTAV"
    },
    {
        "id": "2NUJE5NRRQ",
        "lat": 23.4939273466,
        "lng": 121.340046367,
        "name": "建築 2NUJE5NRRQ"
    },
    {
        "id": "2NQL35NSB0",
        "lat": 23.4944403939,
        "lng": 121.336093748,
        "name": "建築 2NQL35NSB0"
    },
    {
        "id": "2NRFW5NSEF",
        "lat": 23.4945327776,
        "lng": 121.336968358,
        "name": "建築 2NRFW5NSEF"
    },
    {
        "id": "2NQE85NSDU",
        "lat": 23.494525629,
        "lng": 121.33589892,
        "name": "建築 2NQE85NSDU"
    },
    {
        "id": "2NQT45NSRD",
        "lat": 23.4948508206,
        "lng": 121.336310971,
        "name": "建築 2NQT45NSRD"
    },
    {
        "id": "2NQMU5NSXK",
        "lat": 23.4950260058,
        "lng": 121.336144927,
        "name": "建築 2NQMU5NSXK"
    },
    {
        "id": "2NUV95NS2H",
        "lat": 23.4941628364,
        "lng": 121.340377417,
        "name": "建築 2NUV95NS2H"
    },
    {
        "id": "2NUL95NS0F",
        "lat": 23.49411684,
        "lng": 121.340096222,
        "name": "建築 2NUL95NS0F"
    },
    {
        "id": "2NQHB5NSKX",
        "lat": 23.4946932093,
        "lng": 121.336005797,
        "name": "建築 2NQHB5NSKX"
    },
    {
        "id": "2NQNQ5NSCW",
        "lat": 23.4944905772,
        "lng": 121.336172835,
        "name": "建築 2NQNQ5NSCW"
    },
    {
        "id": "2P5KB5N3WT",
        "lat": 23.4737122162,
        "lng": 121.349045545,
        "name": "建築 2P5KB5N3WT"
    },
    {
        "id": "2P5JF5N5QT",
        "lat": 23.4753878379,
        "lng": 121.349022925,
        "name": "建築 2P5JF5N5QT"
    },
    {
        "id": "2Q6HN5NHLB",
        "lat": 23.4862774262,
        "lng": 121.382109594,
        "name": "建築 2Q6HN5NHLB"
    },
    {
        "id": "2Q6RP5NJEK",
        "lat": 23.487034335,
        "lng": 121.382363744,
        "name": "建築 2Q6RP5NJEK"
    },
    {
        "id": "2PQDG5N4A8",
        "lat": 23.4739980908,
        "lng": 121.367908975,
        "name": "建築 2PQDG5N4A8"
    },
    {
        "id": "2PPUW5N3R6",
        "lat": 23.473508895,
        "lng": 121.367383157,
        "name": "建築 2PPUW5N3R6"
    },
    {
        "id": "2PQ775N3V4",
        "lat": 23.4736190785,
        "lng": 121.367711336,
        "name": "建築 2PQ775N3V4"
    },
    {
        "id": "2PQ6W5N40V",
        "lat": 23.4737296647,
        "lng": 121.367703654,
        "name": "建築 2PQ6W5N40V"
    },
    {
        "id": "2PR4G5N40F",
        "lat": 23.4737147666,
        "lng": 121.368628777,
        "name": "建築 2PR4G5N40F"
    },
    {
        "id": "2PQ905N438",
        "lat": 23.4737967176,
        "lng": 121.367767969,
        "name": "建築 2PQ905N438"
    },
    {
        "id": "2PQ435N44L",
        "lat": 23.4738367008,
        "lng": 121.367613618,
        "name": "建築 2PQ435N44L"
    },
    {
        "id": "2PQC55N455",
        "lat": 23.4738512099,
        "lng": 121.367866594,
        "name": "建築 2PQC55N455"
    },
    {
        "id": "2PPL65N43B",
        "lat": 23.4738003902,
        "lng": 121.367115506,
        "name": "建築 2PPL65N43B"
    },
    {
        "id": "2PQKW5N4NA",
        "lat": 23.474346838,
        "lng": 121.368111912,
        "name": "建築 2PQKW5N4NA"
    },
    {
        "id": "2Q4HA5NSB2",
        "lat": 23.4943354116,
        "lng": 121.380115766,
        "name": "建築 2Q4HA5NSB2"
    },
    {
        "id": "2Q4GL5NS93",
        "lat": 23.494278201,
        "lng": 121.380093505,
        "name": "建築 2Q4GL5NS93"
    },
    {
        "id": "2Q4K45NS74",
        "lat": 23.4942213268,
        "lng": 121.380172136,
        "name": "建築 2Q4K45NS74"
    },
    {
        "id": "2PVQ25NUJ5",
        "lat": 23.4964110254,
        "lng": 121.373314134,
        "name": "建築 2PVQ25NUJ5"
    },
    {
        "id": "2PW0Q5NUMJ",
        "lat": 23.4965044346,
        "lng": 121.373587536,
        "name": "建築 2PW0Q5NUMJ"
    }
];